Глобально:
множество поверхностей
объемы

проблема: если объем оперирует с указателями, то при создании копий все накрывается
можно создавать копию объема из копий


параметрический мир 
- детали по номерам в непрерывном мире, их эпсилоны
- =( в парадигме домен-декомпозишн детали неразделимы от связанных систем координат
- правая часть как функция, сорт оф







for i
множество параметров раз
множество параметров два 
множество параметров три
end

множество солверов

множество солверов тензорно перемножить на множество 

солвер:
- тол
- 